# Fonts
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-inter"

# CLI tools
brew "awscli"
brew "flyctl"
brew "fnm"
brew "planetscale/tap/pscale"
brew "ripgrep"
brew "tursodatabase/tap/turso"
cask "ngrok"
brew "tmux"
brew "neovim"

# Services
brew "redis"
cask "docker"
cask "karabiner-elements"

# Runtimes
brew "deno"
brew "oven-sh/bun/bun"
brew "go"
brew "rust"

# Applications
cask "wezterm"
cask "slack"
cask "jetbrains-toolbox"
cask "google-chrome"
cask "chatgpt"
cask "discord"
cask "firefox"
cask "microsoft-teams"
cask "notion"
cask "rectangle"
cask "visual-studio-code"
cask "zoom"
cask "wifiman"
