# Fonts
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-inter"

# CLI tools
brew "awscli"
brew "fnm"
brew "ripgrep"
cask "ngrok"
brew "tmux"
brew "neovim"

# Services
brew "redis"
cask "karabiner-elements"

# Runtimes
brew "deno"
brew "oven-sh/bun/bun"

# Applications
cask "google-chrome"
cask "firefox"
cask "rectangle"
cask "visual-studio-code"
cask "ghostty"
